controllers/MaintenanceScheduleController.php

INSERT INTO `maintenance_schedule` (`ship_id`, `schedule_date`, `status`, `created_at`) VALUES (3, '2024-12-20', 'pending', '2024-06-21 00:00:00')
---
    public function actionCreate()
    {
        $model = new MaintenanceSchedule();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {

SELECT * FROM `maintenance_schedule` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = MaintenanceSchedule::findOne(['id' => $id])) !== null) {