controllers/MaintenanceRecordController.php

    public function actionCreate()
    {
        $model = new MaintenanceRecord();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `maintenance_record` (`schedule_id`, `description`, `cost`, `performed_by`, `created_at`) VALUES (2, 'Pengecekan sistem navigasi.', '15000000', 'Staff Teknisi dani', '2024-06-21 14:20:00')

    protected function findModel($id)
    {
        if (($model = MaintenanceRecord::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `maintenance_record` WHERE `id`='1'