controllers/ShipController.php

INSERT INTO `ship` (`name`, `type`, `owner`, `status`, `created_at`) VALUES ('kapal Nusantara', 'Kargo', 'PT Tresnamuda Sejati', 'active', '2023-8-14')
---
    public function actionCreate()
    {
        $model = new Ship();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {

SELECT * FROM `ship` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Ship::findOne(['id' => $id])) !== null) {